GS/OSet/oset.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:t p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t
#+OPTIONS: title:t toc:t todo:t |:t
#+TITLES: oset
#+DATE: <2017-10-09 Mon>
#+AUTHORS: weiwu
#+EMAIL: victor.wuv@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 8.3.4)
#+SETUPFILE: ../../configOrg/level2.org

* stock
** 股票因子
*** 标的
*** 仓位
*** 公司财务数据
**** 基础科目与衍生
***** 主要会计数据
***** 现金流量表
***** 资产负债表
***** 利润表
*** 最新持仓
大股东持仓，机构持仓。
**** 增减持仓

*** 原始指标
**** 指数成分
**** 股票所在交易所板块
**** 上市及限售
**** 公司股东与股本
***** 股东股权变动
***** 股权分置
***** 股东户数
***** 人员持有股份变动情况
**** 股票行情
**** 盈利预测
***** 分析师预测
***** 股票评级
**** 行业划分
***** 中信一级行业
***** 中信三级行业
*** 行为
**** 预测
*** 衍生指标
**** 技术面
***** 行情
***** 压力支撑
***** 趋向
***** 波动
***** 反趋向
***** 能量
***** 成交量
***** 动量
***** 规模
***** 金融工程
**** 基本面
***** 偿债能力资本结构
***** 营运能力
***** 成长
***** 现金流
***** 盈利能力收益质量
***** 每股指标
***** 价值
*** 持仓权重
**** portfolio value
**** portfolio weight
**** portfolio share
* strategy

* doc
** 研究标的为期货
** 研究标的为基金
** 研究标的为股票
** 研究方式为技术面
** 研究方式为基本面
** 研究方式为机器学习和人工智能
** 文档语言为英文
** 文档语言为中文
** 发布类型为研究报告
*** Journal of business strategies
*** the account review
*** The Journal of Finance
*** Quantitative Finance
*** Business finance & accounting
*** Journal of accounting & economy
*** financial management
...

* factor

* f def
libraries classification source:

[[http://usyiyi.cn/translate/python_352/library/index.html][Python Simple Chinese]]

[[https://docs.python.org/3/library/index.html][Python English]]

[[https://en.wikipedia.org/wiki/C_standard_library][C_standard_library]]

[[http://en.cppreference.com/w/c/links/libs][C++]]
** 内置类型
*** 数组处理
*** 添加数据
*** 提取数据
*** 重命名
** 交易相关
** 数据类型

*** 日期时间

*** 数组

*** 类型

*** 打印

** 算术和数学模型

*** 数字

*** 数学
**** 简单运算
**** 多列计算
*** 统计

**** 横截面聚合
**** 统计分析
*** 金融
**** ta-lib
***** 技术指标
**** RiskModel
*** 信号处理
**** 频度调整
**** 频率调整
**** 频率调整-敏感
**** 过滤数据
**** 横截面处理
*** 机器学习
[[https://en.wikipedia.org/wiki/Outline_of_machine_learning][outline of machine learning]]

**** 问题
- 分类
- 聚类
- 回归
  - 模型
线性回归 简单回归 普通最小二乘法 多项式回归 一般线性模型

广义线性模式 离散选择 逻辑回归 多项罗吉特 混合罗吉特 波比 多项式波比 排序性模型 有序波比 泊松回归

等级线性模型 固定效应 随机效应 混合模型

非线性回归 非参数 半参数 稳健 分位数回归 保序回归 主成分 最小角 局部 分段
含误差变量

  - 估计

最小二乘法 普通最小二乘法 线性 偏最小二乘回归 总体 广义 加权 非线性 非负 重复再加权 岭回归 LASSO

最小绝对值导数法 贝叶斯 贝叶斯多元
  - 背景
回归模型检验 平均响应和预测响应 误差和残差 拟合优度 学生化残差 高斯－马尔可夫定理
- 异常检测
关联规则 强化学习 结构预测 特征学习 在线学习 半监督学习 语法归纳
**** 监督学习(分类 · 回归)
- 决策树
- 表征（装袋, 提升，随机森林）
- k-NN
- 线性回归
- 朴素贝叶斯
- 神经网络
http://www.hankcs.com/ml/understanding-the-convolution-in-deep-learning.html
- 逻辑回归
- 感知器
- 支持向量机（SVM）
- 相关向量机（RVM）
**** 聚类

- BIRCH
- 层次
- k平均
- 期望最大化（EM）
- DBSCAN
- OPTICS
- 均值飘移
**** 降维
- 因子分析
- CCA
- ICA
- LDA
- NMF
- PCA
- LASSO
- t-SNE
**** 结构预测

- 概率图模型（贝叶斯网络，CRF, HMM）
**** 异常检测
- k-NN
- 局部离群因子
**** 神经网络

- 自编码
- 深度学习
- 多层感知机
- RNN
- 受限玻尔兹曼机
- SOM
- CNN
**** 理论

- 偏差/方差困境
- 计算学习理论
- 经验风险最小化
- PAC学习
- 统计学习
- VC理论

** 策略管理

*** 组合优化

*** 基金策略

*** 基金经理评估

*** 资产配置模型

*** 策略函数
** 数据分析

*** 组合因子业绩贡献

*** 业绩归因

*** 绩效归因

*** 持仓分析

*** 策略分析

** 数据格式

*** 转换数据类型

*** OOTV
** 数据处理

*** 行业中性

*** 因子加权

*** 升维

*** 面板数据处理
** 通用操作系统服务

*** 系统

*** 时间
**** 日期转换
*** 日志
** 基础框架

*** 模拟交易及绩效

**** 期货

** 金融数据处理

*** 财务相关
** 结构化标记处理工具
*** 时间序列
** 开发工具
*** 编程接口
** 衍生模块

*** 指数相关

*** 事件相关

** 杂项服务
- formatter - 通用输出格式
*** 其它
*** 期货相关
*** FR相关
* fs def

* fs inst
