GS/OSet/oset.tex
% Created 2017-10-09 Mon 19:35
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{weiwu}
\date{\textit{<2017-10-09 Mon>}}
\title{}
\hypersetup{
 pdfauthor={weiwu},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.4)},
 pdflang={English}}
\begin{document}

\tableofcontents


\section{stock}
\label{sec:orgheadline54}
\subsection{股票因子}
\label{sec:orgheadline53}
\subsubsection{标的}
\label{sec:orgheadline1}
\subsubsection{仓位}
\label{sec:orgheadline2}
\subsubsection{公司财务数据}
\label{sec:orgheadline8}
\begin{enumerate}
\item 基础科目与衍生
\label{sec:orgheadline7}
\begin{enumerate}
\item 主要会计数据
\label{sec:orgheadline3}
\item 现金流量表
\label{sec:orgheadline4}
\item 资产负债表
\label{sec:orgheadline5}
\item 利润表
\label{sec:orgheadline6}
\end{enumerate}
\end{enumerate}
\subsubsection{最新持仓}
\label{sec:orgheadline10}
大股东持仓，机构持仓。
\begin{enumerate}
\item 增减持仓
\label{sec:orgheadline9}
\end{enumerate}

\subsubsection{原始指标}
\label{sec:orgheadline26}
\begin{enumerate}
\item 指数成分
\label{sec:orgheadline11}
\item 股票所在交易所板块
\label{sec:orgheadline12}
\item 上市及限售
\label{sec:orgheadline13}
\item 公司股东与股本
\label{sec:orgheadline18}
\begin{enumerate}
\item 股东股权变动
\label{sec:orgheadline14}
\item 股权分置
\label{sec:orgheadline15}
\item 股东户数
\label{sec:orgheadline16}
\item 人员持有股份变动情况
\label{sec:orgheadline17}
\end{enumerate}
\item 股票行情
\label{sec:orgheadline19}
\item 盈利预测
\label{sec:orgheadline22}
\begin{enumerate}
\item 分析师预测
\label{sec:orgheadline20}
\item 股票评级
\label{sec:orgheadline21}
\end{enumerate}
\item 行业划分
\label{sec:orgheadline25}
\begin{enumerate}
\item 中信一级行业
\label{sec:orgheadline23}
\item 中信三级行业
\label{sec:orgheadline24}
\end{enumerate}
\end{enumerate}
\subsubsection{行为}
\label{sec:orgheadline28}
\begin{enumerate}
\item 预测
\label{sec:orgheadline27}
\end{enumerate}
\subsubsection{衍生指标}
\label{sec:orgheadline48}
\begin{enumerate}
\item 技术面
\label{sec:orgheadline39}
\begin{enumerate}
\item 行情
\label{sec:orgheadline29}
\item 压力支撑
\label{sec:orgheadline30}
\item 趋向
\label{sec:orgheadline31}
\item 波动
\label{sec:orgheadline32}
\item 反趋向
\label{sec:orgheadline33}
\item 能量
\label{sec:orgheadline34}
\item 成交量
\label{sec:orgheadline35}
\item 动量
\label{sec:orgheadline36}
\item 规模
\label{sec:orgheadline37}
\item 金融工程
\label{sec:orgheadline38}
\end{enumerate}
\item 基本面
\label{sec:orgheadline47}
\begin{enumerate}
\item 偿债能力资本结构
\label{sec:orgheadline40}
\item 营运能力
\label{sec:orgheadline41}
\item 成长
\label{sec:orgheadline42}
\item 现金流
\label{sec:orgheadline43}
\item 盈利能力收益质量
\label{sec:orgheadline44}
\item 每股指标
\label{sec:orgheadline45}
\item 价值
\label{sec:orgheadline46}
\end{enumerate}
\end{enumerate}
\subsubsection{持仓权重}
\label{sec:orgheadline52}
\begin{enumerate}
\item portfolio value
\label{sec:orgheadline49}
\item portfolio weight
\label{sec:orgheadline50}
\item portfolio share
\label{sec:orgheadline51}
\end{enumerate}
\section{strategy}
\label{sec:orgheadline55}

\section{doc}
\label{sec:orgheadline72}
\subsection{研究标的为期货}
\label{sec:orgheadline56}
\subsection{研究标的为基金}
\label{sec:orgheadline57}
\subsection{研究标的为股票}
\label{sec:orgheadline58}
\subsection{研究方式为技术面}
\label{sec:orgheadline59}
\subsection{研究方式为基本面}
\label{sec:orgheadline60}
\subsection{研究方式为机器学习和人工智能}
\label{sec:orgheadline61}
\subsection{文档语言为英文}
\label{sec:orgheadline62}
\subsection{文档语言为中文}
\label{sec:orgheadline63}
\subsection{发布类型为研究报告}
\label{sec:orgheadline71}
\subsubsection{Journal of business strategies}
\label{sec:orgheadline64}
\subsubsection{the account review}
\label{sec:orgheadline65}
\subsubsection{The Journal of Finance}
\label{sec:orgheadline66}
\subsubsection{Quantitative Finance}
\label{sec:orgheadline67}
\subsubsection{Business finance \& accounting}
\label{sec:orgheadline68}
\subsubsection{Journal of accounting \& economy}
\label{sec:orgheadline69}
\subsubsection{financial management}
\label{sec:orgheadline70}
\ldots{}

\section{factor}
\label{sec:orgheadline73}

\section{f def}
\label{sec:orgheadline153}
libraries classification source:

\href{http://usyiyi.cn/translate/python_352/library/index.html}{Python Simple Chinese}

\href{https://docs.python.org/3/library/index.html}{Python English}

\href{https://en.wikipedia.org/wiki/C_standard_library}{C\(_{\text{standard}}_{\text{library}}\)}

\href{http://en.cppreference.com/w/c/links/libs}{C++}
\subsection{内置类型}
\label{sec:orgheadline78}
\subsubsection{数组处理}
\label{sec:orgheadline74}
\subsubsection{添加数据}
\label{sec:orgheadline75}
\subsubsection{提取数据}
\label{sec:orgheadline76}
\subsubsection{重命名}
\label{sec:orgheadline77}
\subsection{交易相关}
\label{sec:orgheadline79}
\subsection{数据类型}
\label{sec:orgheadline84}

\subsubsection{日期时间}
\label{sec:orgheadline80}

\subsubsection{数组}
\label{sec:orgheadline81}

\subsubsection{类型}
\label{sec:orgheadline82}

\subsubsection{打印}
\label{sec:orgheadline83}

\subsection{算术和数学模型}
\label{sec:orgheadline111}

\subsubsection{数字}
\label{sec:orgheadline85}

\subsubsection{数学}
\label{sec:orgheadline88}
\begin{enumerate}
\item 简单运算
\label{sec:orgheadline86}
\item 多列计算
\label{sec:orgheadline87}
\end{enumerate}
\subsubsection{统计}
\label{sec:orgheadline91}

\begin{enumerate}
\item 横截面聚合
\label{sec:orgheadline89}
\item 统计分析
\label{sec:orgheadline90}
\end{enumerate}
\subsubsection{金融}
\label{sec:orgheadline95}
\begin{enumerate}
\item ta-lib
\label{sec:orgheadline93}
\begin{enumerate}
\item 技术指标
\label{sec:orgheadline92}
\end{enumerate}
\item RiskModel
\label{sec:orgheadline94}
\end{enumerate}
\subsubsection{信号处理}
\label{sec:orgheadline101}
\begin{enumerate}
\item 频度调整
\label{sec:orgheadline96}
\item 频率调整
\label{sec:orgheadline97}
\item 频率调整-敏感
\label{sec:orgheadline98}
\item 过滤数据
\label{sec:orgheadline99}
\item 横截面处理
\label{sec:orgheadline100}
\end{enumerate}
\subsubsection{机器学习}
\label{sec:orgheadline110}
\href{https://en.wikipedia.org/wiki/Outline_of_machine_learning}{outline of machine learning}

\begin{enumerate}
\item 问题
\label{sec:orgheadline102}
\begin{itemize}
\item 分类
\item 聚类
\item 回归
\begin{itemize}
\item 模型
\end{itemize}
\end{itemize}
线性回归 简单回归 普通最小二乘法 多项式回归 一般线性模型

广义线性模式 离散选择 逻辑回归 多项罗吉特 混合罗吉特 波比 多项式波比 排序性模型 有序波比 泊松回归

等级线性模型 固定效应 随机效应 混合模型

非线性回归 非参数 半参数 稳健 分位数回归 保序回归 主成分 最小角 局部 分段
含误差变量

\begin{itemize}
\item 估计
\end{itemize}

最小二乘法 普通最小二乘法 线性 偏最小二乘回归 总体 广义 加权 非线性 非负 重复再加权 岭回归 LASSO

最小绝对值导数法 贝叶斯 贝叶斯多元
\begin{itemize}
\item 背景
\end{itemize}
回归模型检验 平均响应和预测响应 误差和残差 拟合优度 学生化残差 高斯－马尔可夫定理
\begin{itemize}
\item 异常检测
\end{itemize}
关联规则 强化学习 结构预测 特征学习 在线学习 半监督学习 语法归纳
\item 监督学习(分类 · 回归)
\label{sec:orgheadline103}
\begin{itemize}
\item 决策树
\item 表征（装袋, 提升，随机森林）
\item k-NN
\item 线性回归
\item 朴素贝叶斯
\item 神经网络
\end{itemize}
\url{http://www.hankcs.com/ml/understanding-the-convolution-in-deep-learning.html}
\begin{itemize}
\item 逻辑回归
\item 感知器
\item 支持向量机（SVM）
\item 相关向量机（RVM）
\end{itemize}
\item 聚类
\label{sec:orgheadline104}

\begin{itemize}
\item BIRCH
\item 层次
\item k平均
\item 期望最大化（EM）
\item DBSCAN
\item OPTICS
\item 均值飘移
\end{itemize}
\item 降维
\label{sec:orgheadline105}
\begin{itemize}
\item 因子分析
\item CCA
\item ICA
\item LDA
\item NMF
\item PCA
\item LASSO
\item t-SNE
\end{itemize}
\item 结构预测
\label{sec:orgheadline106}

\begin{itemize}
\item 概率图模型（贝叶斯网络，CRF, HMM）
\end{itemize}
\item 异常检测
\label{sec:orgheadline107}
\begin{itemize}
\item k-NN
\item 局部离群因子
\end{itemize}
\item 神经网络
\label{sec:orgheadline108}

\begin{itemize}
\item 自编码
\item 深度学习
\item 多层感知机
\item RNN
\item 受限玻尔兹曼机
\item SOM
\item CNN
\end{itemize}
\item 理论
\label{sec:orgheadline109}

\begin{itemize}
\item 偏差/方差困境
\item 计算学习理论
\item 经验风险最小化
\item PAC学习
\item 统计学习
\item VC理论
\end{itemize}
\end{enumerate}

\subsection{策略管理}
\label{sec:orgheadline117}

\subsubsection{组合优化}
\label{sec:orgheadline112}

\subsubsection{基金策略}
\label{sec:orgheadline113}

\subsubsection{基金经理评估}
\label{sec:orgheadline114}

\subsubsection{资产配置模型}
\label{sec:orgheadline115}

\subsubsection{策略函数}
\label{sec:orgheadline116}
\subsection{数据分析}
\label{sec:orgheadline123}

\subsubsection{组合因子业绩贡献}
\label{sec:orgheadline118}

\subsubsection{业绩归因}
\label{sec:orgheadline119}

\subsubsection{绩效归因}
\label{sec:orgheadline120}

\subsubsection{持仓分析}
\label{sec:orgheadline121}

\subsubsection{策略分析}
\label{sec:orgheadline122}

\subsection{数据格式}
\label{sec:orgheadline126}

\subsubsection{转换数据类型}
\label{sec:orgheadline124}

\subsubsection{OOTV}
\label{sec:orgheadline125}
\subsection{数据处理}
\label{sec:orgheadline131}

\subsubsection{行业中性}
\label{sec:orgheadline127}

\subsubsection{因子加权}
\label{sec:orgheadline128}

\subsubsection{升维}
\label{sec:orgheadline129}

\subsubsection{面板数据处理}
\label{sec:orgheadline130}
\subsection{通用操作系统服务}
\label{sec:orgheadline136}

\subsubsection{系统}
\label{sec:orgheadline132}

\subsubsection{时间}
\label{sec:orgheadline134}
\begin{enumerate}
\item 日期转换
\label{sec:orgheadline133}
\end{enumerate}
\subsubsection{日志}
\label{sec:orgheadline135}
\subsection{基础框架}
\label{sec:orgheadline139}

\subsubsection{模拟交易及绩效}
\label{sec:orgheadline138}

\begin{enumerate}
\item 期货
\label{sec:orgheadline137}
\end{enumerate}

\subsection{金融数据处理}
\label{sec:orgheadline141}

\subsubsection{财务相关}
\label{sec:orgheadline140}
\subsection{结构化标记处理工具}
\label{sec:orgheadline143}
\subsubsection{时间序列}
\label{sec:orgheadline142}
\subsection{开发工具}
\label{sec:orgheadline145}
\subsubsection{编程接口}
\label{sec:orgheadline144}
\subsection{衍生模块}
\label{sec:orgheadline148}

\subsubsection{指数相关}
\label{sec:orgheadline146}

\subsubsection{事件相关}
\label{sec:orgheadline147}

\subsection{杂项服务}
\label{sec:orgheadline152}
\begin{itemize}
\item formatter - 通用输出格式
\end{itemize}
\subsubsection{其它}
\label{sec:orgheadline149}
\subsubsection{期货相关}
\label{sec:orgheadline150}
\subsubsection{FR相关}
\label{sec:orgheadline151}
\section{fs def}
\label{sec:orgheadline154}

\section{fs inst}
\label{sec:orgheadline155}
\end{document}